alibaba-cloud.tongyi-lingma
charliermarsh.ruff
eamodio.gitlens
esbenp.prettier-vscode
fill-labs.dependi
golang.go
gruntfuggly.todo-tree
monokai.theme-monokai-pro-vscode
ms-ceintl.vscode-language-pack-zh-hans
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
pkief.material-icon-theme
rust-lang.rust-analyzer
tamasfe.even-better-toml
usernamehw.errorlens
vadimcn.vscode-lldb
