alibaba-cloud.tongyi-lingma
charliermarsh.ruff
eamodio.gitlens
esbenp.prettier-vscode
fill-labs.dependi
golang.go
gruntfuggly.todo-tree
hbenl.vscode-test-explorer
monokai.theme-monokai-pro-vscode
ms-ceintl.vscode-language-pack-zh-hans
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.test-adapter-converter
pkief.material-icon-theme
rust-lang.rust-analyzer
swellaby.vscode-rust-test-adapter
tamasfe.even-better-toml
usernamehw.errorlens
vadimcn.vscode-lldb
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.azure-repos
github.remotehub
